{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Домашнее задание к лекции \"Функции\"\n",
    "*Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.*\n",
    "\n",
    "**Исходные данные имеют следующую структуру:**\n",
    "\n",
    "**перечень всех документов**\n",
    "\n",
    "` documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]` \n",
    "\n",
    "**перечень полок, на которых хранятся документы (если документ есть в documents, то он обязательно должен быть и в directories)**\n",
    "` directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}`\n",
    "\n",
    "Общие требования к программе:\n",
    "\n",
    "код должен быть грамотно декомпозирован (каждая функция отвечает за свою конкретную задачу, дублирующийся функционал переиспользуется, а его код не повторяется);\n",
    "в коде отсутствуют глобальные переменные (за исключением documents и directories);\n",
    "пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу (вводом команды \"q\")."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}\n",
    "#______________________________________________________________функция вывода имени по номеру (пункт 1)\n",
    "def get_name(documents): \n",
    "    num = input('Введите номер документа ')\n",
    "    for i in documents:\n",
    "        dictionary = i\n",
    "        if dictionary['number'] == num:\n",
    "            return dictionary['name']\n",
    "    else:\n",
    "        return ('Документ не найден в базе')\n",
    "#______________________________________________________________ функция вывода номера полки (пункт 2)\n",
    "def get_key(directories):\n",
    "    num = input('Введите номер документа ')\n",
    "    for k, v in directories.items():\n",
    "        for i in v:\n",
    "            if i == str(num):\n",
    "                return k\n",
    "#______________________________________________________________ функция вывода всей информации (пункт 3)\n",
    "def all_info():\n",
    "    for i in documents:\n",
    "        dictionary = i\n",
    "        number = dictionary['number']\n",
    "        for k, v in directories.items():\n",
    "            for i in v:\n",
    "                if i == number:\n",
    "                    dictionary.update({'branch':k})\n",
    "        print ('№: ',dictionary['number'],', тип: ',dictionary['type'], ', владелец: ',dictionary['name'], ', полка номер: ', dictionary['branch'], sep='')\n",
    "#______________________________________________________________ функция добавления полки (пункт 4)\n",
    "def add_branch_number ():\n",
    "    branch_add = 0\n",
    "    number = input('Введите номер полки: ')\n",
    "    if number in list(directories.keys()):\n",
    "        print('Такая полка уже есть =(')\n",
    "    else:\n",
    "        directories.update({number:[]})\n",
    "        print(f'Полка добавлена. Текущий перечень полок: {\",\".join(directories.keys())}')\n",
    "#______________________________________________________________ функция удаления полки (пункт 5)\n",
    "def del_branch():\n",
    "    branch_del = 0\n",
    "    number = input('Введите номер полки: ')\n",
    "    if number in list(directories.keys()) and directories[number] == []:\n",
    "        del directories[number]\n",
    "        print(f'Полка удалена. Текущий перечень полок: {\",\".join(directories.keys())}')\n",
    "    elif number in directories and directories[number] != []:\n",
    "        print('Полка занята')\n",
    "    else:\n",
    "        print('Такой полки не существует')\n",
    "        \n",
    "def command_request():\n",
    "    if command == ('l'):\n",
    "        all_info()\n",
    "    elif command == ('as'):\n",
    "        add_branch_number ()\n",
    "    elif command == ('ds'):\n",
    "        del_branch()\n",
    "    elif command == ('p'):\n",
    "        print('Владелец документа:', get_name(documents))\n",
    "    elif command == ('s'):\n",
    "        print('Данные хранятся на полке:', get_key(directories))\n",
    "    else:\n",
    "        print('Неверная команда')\n",
    "while True:\n",
    "    command = input('Введите команду ')\n",
    "    if command == ('q'):\n",
    "        break\n",
    "    else:\n",
    "        command_request()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
